/** 
 * Task 1
 * 1. Запитати користувача: "Яка офіційна назва JavaScript?"
 * 2. Перевірити відповідь:
 *    Якщо користувач ввів "ECMAScript", показати alert "Вірно!"
 *    В іншому випадку, "Не знаєте? ECMAScript!"
 * 
 * Про promt і alert дивіться туту https://uk.javascript.info/alert-prompt-confirm
 *  */

// let answer = prompt("Яка офіційна назва JavaScript?");

// if (answer === 'ECMAScript') {
//   alert('Верно!');
// } else {
//   alert('Не знаете? ECMAScript!')
// }

/**-------------------------------------------------------------------- */

/** 
 * Task 2
 * Вивести в консоль строку "14 год. 26 хв", в залежності від значення змінної minutes
 * 1. створюємо зміну для результату
 * 2. порівнюємо minutes з 0
 * 3. Якщо хвилин 0, то в результат підуть тілки години
 * 4. Якщо хвилини не 0, то в результат години і хвилини
 *  */

// const hours = 14;
// const minutes = 0;

/** 1. варінат */ 
// let result = '';
// if (minutes === 0) {
//   result = `${hours} год.`
// } else {
//   result = `${hours} год. ${minutes} хв.`
// }
// console.log(result)

/** 2. варінат */ 
// if (minutes === 0) {
//   console.log(`${hours} год.`)
// } else {
//   console.log(`${hours} год. ${minutes} хв.`)
// }
/**-------------------------------------------------------------------- */


/** 
 * Task 3
 * 
 * 1 Запитати користувача ввести число
 * 2 Якщо ввів 0, вивести в консоль 0
 * 3 Якщо ввів більше 0, вивести "Позитивне число"
 * 4 Якщо ввів менше нуля, вивести "Негативне число"
 * 
 *  */

// let value = Number(prompt('Введіть число'));
// console.log(value, typeof value);

// if (value == 0) {
//   console.log('Число нуль')
// } else if(value > 0) {
//   console.log('Число позитивне')
// } else {
//   console.log('Негативне число')
// }

/**-------------------------------------------------------------------- */

/**
 * Task 4
 * 
 * 1. порівняти числа a і b з числом 100
 * 2. Якщо a і b більші від 100, то вивести більше серед a і b
 * 3. В іншому випадку, вивести сумму числа b і числа 512
*/

//  const a = 120;
//  const b = 180;

//  if (a > 100 && b > 100) {
  
//   if (a >= b) {
//     console.log(a)
//   } else {
//     console.log(b)
//   }

//  } else {
//   console.log(b + 512)
//  }

/**-------------------------------------------------------------------- */

/**
  * Task 5
  * Додати в кінець строки link символ '/', якщо його там нема.
  * 1. Перевірити яким символом закінчується змінна link
  * 2. Якщо останній символ НЕ '/', то додати його в кінець рядка
*/

// let link = 'https://my-site.com/about';

// if (!link.endsWith('/')) {
//   link += '/'
// }

// console.log(link)

/**-------------------------------------------------------------------- */

/**
 * Task 6
 * 1. перевірити чи закінчується рядок link симоволом '/'
 * 2. перевірити чи рядок link включає в себе підстроку "my-site"
 * 3. Якщо умови 1 і 2 виконані, додаємо '/' в кінець рядка
 */

//  let link = 'https://my-site.com/about';

//  if (!link.endsWith('/') && link.includes('my-site')) {
//     link += '/'
//  }
//  console.log(link)

/**-------------------------------------------------------------------- */

/**
 * Task 7
 * Переписати розгалудження на тернарний оператор
 *    let link = 'https://my-site.com/about';
 *    if (link.includes('my-site') && !link.endsWith('/')) {
 *      link += '/';
 *    }
*/

// let link = 'https://my-site.com/about';
// link.includes('my-site') && !link.endsWith('/') ? link += '/' : null;
// console.log(link);

/**-------------------------------------------------------------------- */

/**
 * Task 8
 * Вивести в консоль рядок 'Pending', якщо змінна hours < 17.
 * Вивести в консоль рядок 'Expires', якщо змінна hours >= 17 і hours <= 24.
 * Вивести в консоль рядок 'Overdue', якщо змінна hours > 24.
 */

//  const hours = 24;

//  if (hours < 17) {
//   console.log('Pending')
//  } else if (hours >= 17 && hours <= 24) {
//   console.log('Expires')
//  } else {
//   console.log('Overdue')
//  }

/**-------------------------------------------------------------------- */

/**
 * Task 9
*/

//  const daysUntilDeadline = 5;

//  if (daysUntilDeadline === 0) {
//   console.log('Сьогодні')
//  } else if (daysUntilDeadline === 1) {
//   console.log('Завтра')
//  } else if (daysUntilDeadline === 2) {
//   console.log('Післязавтра')
//  } else if (daysUntilDeadline >= 3) {
//   console.log('Колись пізніше')
//  }

/**-------------------------------------------------------------------- */

/**
 * Task 10. Переписати Task 9 на switch
 */
//  switch(daysUntilDeadline) {
//   case 0: {
//     console.log('Сьогодні');
//     break;
//   }
//   case 1: {
//     console.log('Завтра');
//     break;
//   }
//   case 2: {
//     console.log('Післязавтра');
//     break;
//   }
//   default: {
//     console.log('Колись пізніше')
//   }
//  }
/**-------------------------------------------------------------------- */

/**
 * Task 11
 * Написати цикл, який виведе в консоль всі числа кратні 5 в проміжку від min до max.
 * Створюємо цикл, де 
 * 1. лічильник 'i' ініціалізується значенням змінної min
 * 2. умова виконання циклу, допоки лічильник буде меньшим за значення змінної max
 * 3. постумова, збульшуємо значення лічильника на одиницю.
 * 4. тіло цикла, перевіряє остачу від ділення на 5. Якщо остача 0, значить число кратне 5, виводимо його в консоль
 */

// const max = 100;
// const min = 20;

// for (let i = min; i <= max; i += 1) {
//   if (i % 5 === 0) {
//     console.log(i)
//   } 
// }
/**-------------------------------------------------------------------- */

/**
 * Task 12
 * 1. Запитуємо користувача ввести логін.
 * 2. Якщо ввели 'Адмін', то запитуємо ввести пароль.
 *  2.1 Якщо пароль не ввели, або натиснули кнопку 'Cancel', або натиснула клавішу Esc, виводимо в консоль 'Відмінено'
 *  2.2 Якщо ввели пароль 'Я адмін', виводимо в консоль 'Привіт'
 *  2.3 Якщо ввели якийсь інший пароль, виводимо в консоль 'Пароль невірний'
 * 3. Якщо ввели щось інше, то виводи в консоль 'Не знаю Вас'
*/

// let login = prompt('Введіть логін');
// let password;
// console.log(login)

// if (login === 'Адмін') {
  
  // password = prompt('введіть пароль');
  // console.log(password, typeof password);

  // if (!password) {
  //   console.log('Відмінено')
  // } else if (password === 'Я адмін') {
  //   console.log('Привіт')
  // } else {
  //   console.log('пароль не вірний')
  // }

// } else {
//   console.log('Не знаю Вас')
// }