/**
 * Task 1 - Індекс маси тіла.
 * Напиши функцію `calcBMI(weight, height)` яка розраховує та повертає
 * індекс маси тіла. Для цього необхідно розділити вагу в кілограмах на
 * квадрат висоти людини в метрах.
 * 
 * Індекс маси тіла необхідно округлити до однієї цифри після коми
 */

/**
 * Task 9 - Колекція курсів.
 * Напишіть функції для роботи з колекцією навчальних курсів `courses`:
 * ['HTML', 'CSS', 'JavaScript', 'React', 'PostgreSQL'];
 * 
 * - `addCourse(name)` - додає курс до кінця колекції
 * - `removeCourse(name)` - видаляє курс з колекції
 * - `updateCourse(oldName, newName)` - змінює ім'я на нове
 */